package ru.pa4ok.lab4;

/**
 * Реализовать структуру данных двоичное дерево поиска и следующие методы
 * - нахождение минимума
 * - нахождение максимума
 * - прямой (preorder)
 * - центрированный (inorder)
 * - обратный обход (postorder)
 * - поиск элемента
 * - нахождение следующего и предыдущего элемента
 * - удаление элемента
 * - обход в ширину
 *
 * Реализовать визуализацию дерева
 * Указать теоретическую временную сложность для всех операций
 * С помощью реализованной структуры данных написать программу, позволяющую преобразовать запись из
 * префиксной/инфиксной/постфиксной нотации в префиксную/инфиксную/постфиксную нотацию
 */
public class Application
{
    public static void main(String[] args)
    {

    }
}
