package ru.pa4ok.lab3;

/**
 * Реализовать следующие алгоритмы сортировки:
 * 1. Сортировка вставками (Insertion sort)
 * 2. Сортировка выбором (Selection sort)
 * 3. Пузырьковая сортировка (Bubble sort)
 * 4. Сортировка слиянием (Merge sort)
 * 5. Сортировка Шелла (Shell sort)
 * 6. Быстрая сортировка (Quick sort)
 *
 * Для каждого алгоритма сортировки указать временную асимптотическую сложность для лучшего, худшего случая и
 * среднего случая, а также пространственную сложность, подкрепив это логическими построениями (в меру своих сил).
 * Свести получившиеся результаты в таблицу. Построить график зависимости времени выполнения от размера входных
 * данных и определить временную асимптотическую сложность для лучшего, худшего, среднего случая практически.
 * Определить наиболее быстрый алгоритм сортировки. Сравнить скорость его выполнения с одним из алгоритмов сортировки
 * из базовых библиотек языка.
 */

/**
 * забавно, но похожим я уже занимался, поэтому 70% лабы это копипаст
 * https://github.com/Pa4ok/Pa4okLib/blob/master/src/main/java/ru/pa4ok/library/util/SortUtil.java
 * все сортировки сделаны под int[], чтобы упростить и сделать более явными результаты тестирования
 * тесты на корректность реализации: src/test/java/ru/pa4ok/lab3/ImplTest.java
 */
public class Application
{
    public static void main(String[] args)
    {

    }
}
